bench/tier3_results/run_20260628_203044.log
[T3] ╔══════════════════════════════════════════════════════════╗
[T3] ║         Wolf Language — Tier 3 Load Test Suite           ║
[T3] ║  Target: http://127.0.0.1:19090                        ║
[T3] ╚══════════════════════════════════════════════════════════╝
[T3] 
[T3] Building Wolf server: ./e2e/testdata/61_route_ping.wolf
[T3] Starting Wolf server on port 19090...
[T3] Server ready on port 19090 (pid 61677)
[T3] 
[T3] ── T3-01: Baseline Throughput (/ping, 4t/100c/30s) ──
[T3] Running T3-01: Baseline /ping throughput
Running 30s test @ http://127.0.0.1:19090/ping
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.88ms    4.91ms  20.53ms   66.67%
    Req/Sec    10.00      0.00    10.00    100.00%
  Latency Distribution
     50%   12.32ms
     75%   20.53ms
     90%   20.53ms
     99%   20.53ms
  3 requests in 30.09s, 330.00B read
  Socket errors: connect 0, read 296, write 527491, timeout 0
Requests/sec:      0.10
Transfer/sec:      10.97B
❌ FAIL T3-01: RPS 0.10 < required 40000
❌ FAIL T3-01: p99 20.53ms > limit 5ms
✅ PASS T3-01: 0 errors (zero errors expected)
[T3] 
[T3] ── T3-02: JSON Serialization Throughput (4t/100c/30s) ──
⚠️  WARN T3-02 currently uses /ping (small JSON). Wire a /users/1 endpoint with 1KB JSON for full spec compliance.
[T3] Running T3-02: JSON payload throughput
unable to connect to 127.0.0.1:19090 Connection refused
[T3] Server stopped (pid 61677)