bench/tier3_results/run_20260628_203307.log
[T3] ╔══════════════════════════════════════════════════════════╗
[T3] ║         Wolf Language — Tier 3 Load Test Suite           ║
[T3] ║  Target: http://127.0.0.1:19090                        ║
[T3] ╚══════════════════════════════════════════════════════════╝
[T3] 
[T3] Building Wolf server: ./e2e/testdata/61_route_ping.wolf
[T3] Starting Wolf server on port 19090...
[T3] Server ready on port 19090 (pid 62274)
[T3] 
[T3] ── T3-01: Baseline Throughput (/ping, 4t/100c/30s) ──
[T3] Running T3-01: Baseline /ping throughput
Running 30s test @ http://127.0.0.1:19090/ping
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.14ms    7.59ms  26.50ms   59.62%
    Req/Sec   130.25     38.99   180.00     50.00%
  Latency Distribution
     50%   16.69ms
     75%   23.07ms
     90%   25.36ms
     99%   26.50ms
  52 requests in 30.10s, 5.59KB read
  Socket errors: connect 0, read 254, write 516874, timeout 0
Requests/sec:      1.73
Transfer/sec:     190.01B
❌ FAIL T3-01: RPS 1.73 < required 40000
❌ FAIL T3-01: p99 26.50ms > limit 5ms
✅ PASS T3-01: 0 errors (zero errors expected)
[T3] 
[T3] ── T3-02: JSON Serialization Throughput (4t/100c/30s) ──
⚠️  WARN T3-02 currently uses /ping (small JSON). Wire a /users/1 endpoint with 1KB JSON for full spec compliance.
[T3] Running T3-02: JSON payload throughput
unable to connect to 127.0.0.1:19090 Connection refused
[T3] Server stopped (pid 62274)