bench/tier3_results/run_20260629_000130.log
[T3] ╔══════════════════════════════════════════════════════════╗
[T3] ║         Wolf Language — Tier 3 Load Test Suite           ║
[T3] ║  Target: http://127.0.0.1:19090                        ║
[T3] ╚══════════════════════════════════════════════════════════╝
[T3] 
[T3] Building Wolf server: ./e2e/testdata/61_route_ping.wolf
[T3] Starting Wolf server on port 19090...
[T3] Server ready on port 19090 (pid 102482)
[T3] 
[T3] ── T3-01: Baseline Throughput (/ping, 4t/100c/30s) ──
[T3] Running T3-01: Baseline /ping throughput
Running 30s test @ http://127.0.0.1:19090/ping
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.20ms   12.69ms 186.02ms   88.95%
    Req/Sec     3.66k     1.44k   11.95k    74.15%
  Latency Distribution
     50%    5.10ms
     75%   12.59ms
     90%   23.07ms
     99%   57.51ms
  433190 requests in 30.10s, 45.44MB read
Requests/sec:  14390.16
Transfer/sec:      1.51MB
❌ FAIL T3-01: RPS 14390.16 < required 40000
❌ FAIL T3-01: p99 57.51ms > limit 5ms
✅ PASS T3-01: 0 errors (zero errors expected)
[T3] 
[T3] ── T3-02: JSON Serialization Throughput (4t/100c/30s) ──
⚠️  WARN T3-02 currently uses /ping (small JSON). Wire a /users/1 endpoint with 1KB JSON for full spec compliance.
[T3] Running T3-02: JSON payload throughput
Running 30s test @ http://127.0.0.1:19090/ping
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.75ms   11.08ms 157.53ms   87.25%
    Req/Sec     3.62k     1.24k   13.33k    77.04%
  Latency Distribution
     50%    4.99ms
     75%   12.64ms
     90%   22.62ms
     99%   49.49ms
  430006 requests in 30.06s, 45.11MB read
Requests/sec:  14304.94
Transfer/sec:      1.50MB
❌ FAIL T3-02: RPS 14304.94 < required 20000
❌ FAIL T3-02: p99 49.49ms > limit 10ms
✅ PASS T3-02: 0 errors (zero errors expected)
[T3] 
[T3] ── T3-05: Overload Test (8t/500c/30s) ──
Running 30s test @ http://127.0.0.1:19090/ping
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.09ms   21.09ms 172.48ms   70.32%
    Req/Sec     2.73k     1.16k   11.46k    83.66%
  Latency Distribution
     50%   18.73ms
     75%   34.33ms
     90%   50.85ms
     99%   91.21ms
  645396 requests in 30.11s, 67.70MB read
  Socket errors: connect 0, read 2, write 18, timeout 0
  Non-2xx or 3xx responses: 20
Requests/sec:  21434.27
Transfer/sec:      2.25MB
[T3] T3-05: 20 errors / 645396 requests = error rate .000030
✅ PASS T3-05: error rate .000030 < 0.1%
[T3] Server stopped (pid 102482)
[T3] 
[T3] ── T3-04: Memory Stability (5-minute run) ──
⚠️  WARN T3-04 requires a manual run. Start your Wolf server, then run:
⚠️  WARN   watch -n 10 'ps aux | grep wolf | grep -v grep | awk "{print \$6}"'
⚠️  WARN   Plot with: cat ./bench/tier3_results/rss_samples_*.txt | python3 bench/plot_results.py
⚠️  WARN Auto-sampling is available via WOLF_MEM_TEST=1 environment variable.
[T3] 
[T3] ── T3-03: DB-bound Throughput — Manual Only ──
⚠️  WARN T3-03 requires a live DB. Start a Wolf server with a SELECT route,
⚠️  WARN then run: /tmp/wrk/wrk -t4 -c150 -d60s http://localhost:PORT/users/1
⚠️  WARN Pass criteria: >= 8,000 RPS, zero panics, connection pool holds.
⚠️  WARN Current bench results are in bench/results_real_wolf.txt
[T3] 
[T3] ╔══════════════════════════════════════════════════════════╗
[T3] ║                    T3 Suite Summary                      ║
[T3] ║  Passed: 1  Failed: 2                                ║
[T3] ╚══════════════════════════════════════════════════════════╝
[T3] Full log: ./bench/tier3_results/run_20260629_000130.log